app/services/user_service.rb

    def fetch_all_users
      Rails.logger.info("Fetching all users")
      User.all.order(:check_in_time).to_a
---
SELECT "users".* FROM "users" ORDER BY "users"."check_in_time" ASC